
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>统一接入平台 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="shu-ju-chu-li-ping-tai.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    分布式架构规划
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    统一接入平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="shu-ju-chu-li-ping-tai.html">
            
                <a href="shu-ju-chu-li-ping-tai.html">
            
                    
                    数据交换平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="yuan-shu-ju-guan-li-ping-tai.html">
            
                <a href="yuan-shu-ju-guan-li-ping-tai.html">
            
                    
                    元数据管理平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="backend_services.html">
            
                <a href="backend_services.html">
            
                    
                    后台服务平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="monitor_platform.html">
            
                <a href="monitor_platform.html">
            
                    
                    统一监控平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="last_tech.html">
            
                <a href="last_tech.html">
            
                    
                    前沿技术
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="distributed_middleware.html">
            
                <a href="distributed_middleware.html">
            
                    
                    分布式中间件研究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="low_latency_comm.html">
            
                <a href="low_latency_comm.html">
            
                    
                    低延迟技术研究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="blockchain.html">
            
                <a href="blockchain.html">
            
                    
                    区块链技术研究
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="challenge-and-chances.html">
            
                <a href="challenge-and-chances.html">
            
                    
                    挑战与机遇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="fen-bu-shi-shu-ju-ku-de-tiao-zhan.html">
            
                <a href="fen-bu-shi-shu-ju-ku-de-tiao-zhan.html">
            
                    
                    分布式数据库的挑战
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >统一接入平台</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7EDF;&#x4E00;&#x63A5;&#x5165;&#x5E73;&#x53F0;">&#x7EDF;&#x4E00;&#x63A5;&#x5165;&#x5E73;&#x53F0;</h1>
<hr>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x652F;&#x6301;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#xFF0C;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x4F9D;&#x6258;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x5BF9;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x63A5;&#x6536;&#x7684;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x667A;&#x80FD;&#x8DEF;&#x7531;&#x3002;&#x8FD9;&#x6837;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x7528;&#x660E;&#x786E;&#x5404;&#x4E2A;&#x8BF7;&#x6C42;&#x6240;&#x8981;&#x5BF9;&#x5E94;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x548C;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x76F8;&#x5173;&#x7684;&#x7528;&#x6237;&#x8BA4;&#x8BC1;&#x3002;</p>
<p>&#x91C7;&#x7528;&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x80FD;&#x591F;&#x5C4F;&#x853D;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x540E;&#x53F0;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x53D8;&#x5316;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4ECE;&#x800C;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x7684;&#x63D0;&#x9AD8;&#x90E8;&#x7F72;&#x7684;&#x7075;&#x6D3B;&#x5EA6;&#xFF0C;&#x9002;&#x5E94;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x672A;&#x6765;&#x4E1A;&#x52A1;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p><img src="assets/import3.png" alt=""></p>
<p>&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x5B9A;&#x4F4D;&#x4E3A;&#x4E0D;&#x627F;&#x8F7D;&#x4EFB;&#x4F55;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x53EA;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x5E73;&#x53F0;&#x5B9A;&#x4F4D;&#xFF0C;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6280;&#x672F;&#x8981;&#x6C42;&#xFF1A;</p>
<h2 id="1-&#x9AD8;&#x5B89;&#x5168;&#x6027;">1. &#x9AD8;&#x5B89;&#x5168;&#x6027; </h2>
<p>&#x5728;&#x5E94;&#x7528;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x7EDF;&#x4E00;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x662F;&#x9632;&#x536B;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x7684;&#x7B2C;&#x4E00;&#x9053;&#x5C4F;&#x969C;&#xFF0C;&#x56E0;&#x6B64;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x5E73;&#x53F0;&#x7684;&#x5B89;&#x5168;&#x6027;&#x8BBE;&#x8BA1;&#x653E;&#x5728;&#x4E86;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x7684;&#x9996;&#x8981;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x4E9B;&#x5B89;&#x5168;&#x6027;&#x7684;&#x8BBE;&#x8BA1;&#x5305;&#x62EC;&#xFF1A;</p>
<h3 id="&#x652F;&#x6301;&#x56FD;&#x4EA7;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;">&#x652F;&#x6301;&#x56FD;&#x4EA7;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5; </h3>
<h3 id="&#x652F;&#x6301;ssl&#x901A;&#x9053;&#x52A0;&#x5BC6;">&#x652F;&#x6301;SSL&#x901A;&#x9053;&#x52A0;&#x5BC6; </h3>
<h3 id="&#x652F;&#x6301;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x9ED1;&#x767D;&#x540D;&#x5355;">&#x652F;&#x6301;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x9ED1;&#x3001;&#x767D;&#x540D;&#x5355; </h3>
<h3 id="&#x652F;&#x6301;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x9632;ddos&#x653B;&#x51FB;&#x7B56;&#x7565;">&#x652F;&#x6301;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x9632;DDOS&#x653B;&#x51FB;&#x7B56;&#x7565;&#xFF1B; </h3>
<h3 id="&#x652F;&#x6301;&#x52A8;&#x6001;&#x6D41;&#x63A7;&#x7B56;&#x7565;">&#x652F;&#x6301;&#x52A8;&#x6001;&#x6D41;&#x63A7;&#x7B56;&#x7565;&#x3002; </h3>
<h2 id="2-&#x9AD8;&#x6269;&#x5C55;&#x6027;">2. &#x9AD8;&#x6269;&#x5C55;&#x6027; </h2>
<p>&#x7528;&#x4E8E;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x4E2D;&#x7684;&#x5404;&#x4E2A;&#x670D;&#x52A1;&#x5747;&#x8BBE;&#x8BA1;&#x6210;&#x4E3A;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x63A5;&#x5165;&#x670D;&#x52A1;&#xFF0C;&#x652F;&#x6301;&#x5E73;&#x884C;&#x6269;&#x5C55;&#x3001;&#x52A8;&#x6001;&#x6A2A;&#x5411;&#x6269;&#x5C55;&#x548C;&#x65E0;&#x7F1D;&#x5207;&#x6362;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x76F8;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x7075;&#x6D3B;&#x7684;&#x90E8;&#x7F72;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x591F;&#x968F;&#x4E1A;&#x52A1;&#x7684;&#x589E;&#x957F;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x6269;&#x5145;&#x3002;</p>
<h3 id="&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x65E0;&#x5173;&#x8054;">&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x65E0;&#x5173;&#x8054; </h3>
<p>&#x7531;&#x4E8E;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x786E;&#x4FDD;&#x6574;&#x4E2A;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x5E73;&#x53F0;&#x4E2D;&#x5404;&#x4E2A;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x5173;&#x8054;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x90E8;&#x7F72;&#x65F6;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x4FBF;&#x4E8E;&#x90E8;&#x7F72;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#x5404;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x4E0D;&#x4F1A;&#x5F62;&#x6210;&#x74F6;&#x9888;&#xFF0C;&#x4FBF;&#x4E8E;&#x7CFB;&#x7EDF;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x6269;&#x5C55;&#x800C;&#x65B9;&#x4FBF;&#x7684;&#x90E8;&#x7F72;&#x3002;</p>
<h3 id="&#x670D;&#x52A1;&#x4EFB;&#x610F;&#x5207;&#x6362;">&#x670D;&#x52A1;&#x4EFB;&#x610F;&#x5207;&#x6362; </h3>
<p>&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E4B;&#x524D;&#x7684;&#x90E8;&#x7F72;&#x914D;&#x7F6E;&#xFF0C;&#x4EFB;&#x610F;&#x8FDE;&#x63A5;&#x76F8;&#x5E94;&#x7684;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#xFF0C;&#x5F53;&#x5176;&#x8FDE;&#x63A5;&#x7684;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5230;&#x5176;&#x4ED6;&#x4EFB;&#x610F;&#x4E00;&#x53F0;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#xFF0C;&#x6574;&#x4E2A;&#x5207;&#x6362;&#x8FC7;&#x7A0B;&#x4E0D;&#x6D89;&#x53CA;&#x5230;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x95F4;&#x7684;&#x72B6;&#x6001;&#x5207;&#x6362;&#x548C;&#x540C;&#x6B65;&#x3002;&#x8FD9;&#x6837;&#x5207;&#x6362;&#x7684;&#x8FC7;&#x7A0B;&#x4F1A;&#x975E;&#x5E38;&#x4FBF;&#x5229;&#xFF0C;&#x800C;&#x4E14;&#x4EFB;&#x4E00;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x5747;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#x8DEF;&#x7531;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#x3002;</p>
<h3 id="&#x670D;&#x52A1;&#x4E0E;&#x4E3B;&#x673A;&#x65E0;&#x5173;">&#x670D;&#x52A1;&#x4E0E;&#x4E3B;&#x673A;&#x65E0;&#x5173; </h3>
<p>&#x670D;&#x52A1;&#x7684;&#x90E8;&#x7F72;&#x548C;&#x8FD0;&#x884C;&#x4E0E;&#x4E3B;&#x673A;&#x65E0;&#x5173;&#xFF0C;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x4E0A;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x591A;&#x5957;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E3B;&#x673A;&#x7684;&#x786C;&#x4EF6;&#x6761;&#x4EF6;&#xFF0C;&#x90E8;&#x7F72;&#x591A;&#x5957;&#x7528;&#x6237;&#x63A5;&#x5165;&#x670D;&#x52A1;&#xFF0C;&#x5145;&#x5206;&#x5229;&#x7528;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x3002;</p>
<h2 id="3-&#x9AD8;&#x6027;&#x80FD;&#x63A5;&#x5165;">3. &#x9AD8;&#x6027;&#x80FD;&#x63A5;&#x5165; </h2>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x51CF;&#x5C11;&#x5F15;&#x5165;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x5BF9;&#x6574;&#x4E2A;&#x4EA4;&#x6613;&#x8FC7;&#x7A0B;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E0A;&#x5EF6;&#x65F6;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x5145;&#x5206;&#x8003;&#x8651;&#x4E86;&#x5904;&#x7406;&#x5EF6;&#x65F6;&#x548C;&#x541E;&#x5410;&#x91CF;&#x8FD9;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x3002;<br>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5404;&#x4E2A;&#x8FDE;&#x63A5;&#x4E0A;&#x7684;&#x5E72;&#x6270;&#xFF0C;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x5C06;&#x6839;&#x636E;&#x8BF7;&#x6C42;&#x670D;&#x52A1;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5C06;&#x5404;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x4EA4;&#x4E92;&#x5206;&#x522B;&#x90E8;&#x7F72;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8FDE;&#x63A5;&#x4E0A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EA4;&#x6613;&#x548C;&#x67E5;&#x8BE2;&#x5C06;&#x5206;&#x522B;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8FDE;&#x63A5;&#x901A;&#x9053;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x786E;&#x4FDD;&#x4EA4;&#x6613;&#x9AD8;&#x6548;&#x6267;&#x884C;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x4E5F;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x4E0D;&#x5F71;&#x54CD;&#x5230;&#x4EA4;&#x6613;&#x7684;&#x5904;&#x7406;&#x3002;<br>&#x652F;&#x6491;&#x6839;&#x636E;Service&#x5212;&#x5206;&#x4E0D;&#x540C;&#x7684;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x7EC4;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x7EC4;&#x6240;&#x5904;&#x7406;&#x7684;&#x6D88;&#x606F;&#x5C06;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x5F53;&#x540E;&#x53F0;&#x5E7F;&#x64AD;&#x884C;&#x60C5;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x533A;&#x5206;&#x7279;&#x5B9A;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x7EC4;&#xFF0C;&#x5219;&#x6240;&#x6709;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x5C06;&#x90FD;&#x83B7;&#x5F97;&#x5E7F;&#x5E03;&#x884C;&#x60C5;&#x5E76;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;&#x800C;&#x5982;&#x679C;&#x6839;&#x636E;&#x884C;&#x60C5;Service&#x6765;&#x5212;&#x5206;&#x7279;&#x5B9A;&#x7EC4;&#x540E;&#xFF0C;&#x5219;&#x53EA;&#x9700;&#x8981;&#x53D1;&#x9001;&#x7ED9;&#x8BE5;&#x7EC4;&#x7684;&#x8FDB;&#x7A0B;&#x5373;&#x53EF;&#xFF0C;&#x53EF;&#x5927;&#x5927;&#x51CF;&#x8F7B;&#x5176;&#x4ED6;&#x63A5;&#x5165;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 分布式架构规划">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="shu-ju-chu-li-ping-tai.html" class="navigation navigation-next " aria-label="Next page: 数据交换平台">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"统一接入平台","level":"1.2","depth":1,"next":{"title":"数据交换平台","level":"1.3","depth":1,"path":"shu-ju-chu-li-ping-tai.md","ref":"shu-ju-chu-li-ping-tai.md","articles":[]},"previous":{"title":"分布式架构规划","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1.md","mtime":"2017-06-13T11:33:25.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-06-13T11:40:53.602Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

