
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>分布式架构规划 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter1.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    分布式架构规划
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    统一接入平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="shu-ju-chu-li-ping-tai.html">
            
                <a href="shu-ju-chu-li-ping-tai.html">
            
                    
                    数据交换平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="yuan-shu-ju-guan-li-ping-tai.html">
            
                <a href="yuan-shu-ju-guan-li-ping-tai.html">
            
                    
                    元数据管理平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="backend_services.html">
            
                <a href="backend_services.html">
            
                    
                    后台服务平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="monitor_platform.html">
            
                <a href="monitor_platform.html">
            
                    
                    统一监控平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="last_tech.html">
            
                <a href="last_tech.html">
            
                    
                    前沿技术
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="distributed_middleware.html">
            
                <a href="distributed_middleware.html">
            
                    
                    分布式中间件研究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="low_latency_comm.html">
            
                <a href="low_latency_comm.html">
            
                    
                    低延迟技术研究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="blockchain.html">
            
                <a href="blockchain.html">
            
                    
                    区块链技术研究
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="challenge-and-chances.html">
            
                <a href="challenge-and-chances.html">
            
                    
                    挑战与机遇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="fen-bu-shi-shu-ju-ku-de-tiao-zhan.html">
            
                <a href="fen-bu-shi-shu-ju-ku-de-tiao-zhan.html">
            
                    
                    分布式数据库的挑战
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >分布式架构规划</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x89C4;&#x5212;">&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x89C4;&#x5212;</h1>
<p>&#x516C;&#x53F8;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x7684;&#x89C4;&#x5212;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4E1A;&#x52A1;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x7684;&#x9700;&#x6C42;&#x4E4B;&#x4E0A;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x516C;&#x53F8;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x6F14;&#x5316;&#x7684;&#x5FC5;&#x7136;&#x7ED3;&#x679C;&#x3002;&#x516C;&#x53F8;&#x7684;&#x603B;&#x4F53;&#x53D1;&#x5C55;&#x76EE;&#x6807;&#x662F;&#x5EFA;&#x6210;&#x5168;&#x7403;&#x7684;&#x4EBA;&#x6C11;&#x5E01;&#x76F8;&#x5173;&#x4EA7;&#x54C1;&#x7684;&#x4EA4;&#x6613;&#x4E3B;&#x5E73;&#x53F0;&#x548C;&#x5B9A;&#x4EF7;&#x4E2D;&#x5FC3;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x5B8F;&#x4F1F;&#x76EE;&#x6807;&#xFF0C;&#x652F;&#x6491;&#x4E1A;&#x52A1;&#x7684;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x4F53;&#x7CFB;&#x7684;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x53CA;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x6790;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="assets/req.jpg" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x53CA;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x9762;&#x4E34;&#x7740;&#x5982;&#x4E0B;&#x6311;&#x6218;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x4E1A;&#x52A1;&#x54CD;&#x5E94;&#x80FD;&#x529B;&#xFF0C;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x7684;&#x4E1A;&#x52A1;&#x53D1;&#x5C55;&#xFF0C;&#x9002;&#x5E94;&#x4EBA;&#x6C11;&#x5E01;&#x56FD;&#x9645;&#x5316;&#x53D1;&#x5C55;&#x7684;&#x9700;&#x8981;&#xFF1B;</li>
<li>&#x4E1A;&#x52A1;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF08;&#x4F8B;&#x5982;&#x64AE;&#x5408;&#x3001;&#x4EBA;&#x6C11;&#x5E01;&#x56FD;&#x9645;&#x5316;&#xFF09;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3001;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x9760;&#x6027;&#x63D0;&#x51FA;&#x4E86;&#x6311;&#x6218;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x9760;&#x6027;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x7CFB;&#x7EDF;&#x7269;&#x7406;&#x90E8;&#x7F72;&#x80FD;&#x529B;&#xFF08;&#x5305;&#x62EC;&#x591A;&#x4E2D;&#x5FC3;&#x4EA4;&#x6613;&#xFF09;&#x7B49;&#x591A;&#x4E2A;&#x6280;&#x672F;&#x65B9;&#x9762;&#x5230;&#x8FBE;&#x56FD;&#x9645;&#x5148;&#x8FDB;&#x6C34;&#x5E73;&#xFF1B;</li>
<li>&#x539F;&#x6709;&#x7CFB;&#x7EDF;&#x5C42;&#x6B21;&#x5212;&#x5206;&#x4E0D;&#x591F;&#x6E05;&#x6670;&#xFF0C;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x4F5C;&#x4E3A;&#x201C;&#x4EBA;&#x6C11;&#x5E01;&#x76F8;&#x5173;&#x4EA7;&#x54C1;&#x4EA4;&#x6613;&#x4E3B;&#x5E73;&#x53F0;&#x548C;&#x5B9A;&#x4EF7;&#x4E2D;&#x5FC3;&#x201D;&#x7684;&#x5730;&#x4F4D;&#x6240;&#x9700;&#x8981;&#x7684;&#x57FA;&#x7840;&#x5E73;&#x53F0;&#x3002;</li>
</ol>
<p>&#x4E3A;&#x4E86;&#x8FCE;&#x63A5;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#xFF0C;&#x6211;&#x4EEC;&#x542F;&#x52A8;&#x4E86;&#x65B0;&#x4E00;&#x4EE3;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x7684;&#x5EFA;&#x8BBE;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5BF9;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4ECE;&#x539F;&#x6765;&#x7684;&#x201C;&#x7B52;&#x72B6;&#x201D;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x67B6;&#x6784;&#x9010;&#x6B65;&#x5411;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x8F6C;&#x578B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="assets/import.png" alt=""></p>
<p>&#x5C42;&#x6B21;&#x5212;&#x5206;&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#x5316;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5C06;&#x4E1A;&#x52A1;&#x4E0E;&#x6280;&#x672F;&#x5206;&#x79BB;&#xFF0C;&#x5F62;&#x6210;&#x4EE5;&#x7EDF;&#x4E00;&#x95E8;&#x6237;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x7EDF;&#x4E00;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x3001;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x3001;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#x56DB;&#x5C42;&#x67B6;&#x6784;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x67B6;&#x6784;&#x4F53;&#x7CFB;&#x9700;&#x8981;&#x6709;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#xFF0C;&#x670D;&#x52A1;&#x7BA1;&#x63A7;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6211;&#x4EEC;&#x5C42;&#x6B21;&#x67B6;&#x6784;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x89C4;&#x5212;&#x8BBE;&#x8BA1;&#x4E86;&#x5143;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x5E73;&#x53F0;&#x548C;&#x7EDF;&#x4E00;&#x76D1;&#x63A7;&#x5E73;&#x53F0;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="assets/import1.png" alt=""></p>
<ol>
<li>&#x7EDF;&#x4E00;&#x95E8;&#x6237;&#x5BA2;&#x6237;&#x7AEF;&#xFF1A;&#x4E3A;&#x4E86;&#x4F18;&#x5316;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x63D0;&#x5347;&#x5F00;&#x53D1;&#x6548;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x9020;&#x4E86;&#x4EE5;Chromium&#x5185;&#x6838;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#x6DF7;&#x5408;&#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x7528;&#x4EE5;&#x652F;&#x6491;Web&#x3001;&#x624B;&#x6301;&#x8BBE;&#x5907;&#x3001;CS&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5F00;&#x53D1;&#x3002;</li>
<li>&#x7528;&#x6237;&#x7EDF;&#x4E00;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#xFF1A;&#x662F;&#x6574;&#x4E2A;&#x5206;&#x5E03;&#x67B6;&#x6784;&#x7684;&#x63A5;&#x5165;&#x5C42;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x4E8E;TCP&#x3001;HTTP&#x3001;MQ&#x7B49;&#x65B9;&#x5F0F;&#x7684;&#x7EDF;&#x4E00;&#x63A5;&#x5165;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x3001;&#x5B89;&#x5168;&#x63A7;&#x5236;&#x3001;&#x534F;&#x8BAE;&#x8F6C;&#x6362;&#x3001;&#x8DEF;&#x7531;&#x8F6C;&#x53D1;&#x7B49;&#x529F;&#x80FD;&#x3002;</li>
<li>&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#xFF1A;&#x4E3A;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5305;&#x62EC;&#x670D;&#x52A1;&#x914D;&#x7F6E;&#x3001;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x3001;&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x3001;&#x6587;&#x4EF6;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#xFF1B;&#x5B83;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;API&#x4E3A;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x4E86;&#x5E94;&#x7528;&#x95F4;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x3001;&#x4FDD;&#x8BC1;&#x4E86;&#x6D88;&#x606F;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</li>
<li>&#x540E;&#x53F0;&#x670D;&#x52A1;&#x5C42;&#xFF1A;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x53CA;&#x5E94;&#x7528;&#x7684;&#x7279;&#x70B9;&#x628A;&#x76F8;&#x5173;&#x7684;&#x9886;&#x57DF;&#x5212;&#x5206;&#x4E3A;&#x540E;&#x53F0;&#x670D;&#x52A1;&#xFF0C;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x3002;</li>
</ol>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x5982;&#x4F55;&#x652F;&#x6491;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#xFF0C;&#x4ECE;&#x7EDF;&#x4E00;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x3001;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x3001;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="chapter1.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 统一接入平台">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"分布式架构规划","level":"1.1","depth":1,"next":{"title":"统一接入平台","level":"1.2","depth":1,"path":"chapter1.md","ref":"chapter1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2017-06-13T11:33:25.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-06-13T11:40:53.602Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

