
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数据交换平台 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="yuan-shu-ju-guan-li-ping-tai.html" />
    
    
    <link rel="prev" href="chapter1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    分布式架构规划
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    统一接入平台
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="shu-ju-chu-li-ping-tai.html">
            
                <a href="shu-ju-chu-li-ping-tai.html">
            
                    
                    数据交换平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="yuan-shu-ju-guan-li-ping-tai.html">
            
                <a href="yuan-shu-ju-guan-li-ping-tai.html">
            
                    
                    元数据管理平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="backend_services.html">
            
                <a href="backend_services.html">
            
                    
                    后台服务平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="monitor_platform.html">
            
                <a href="monitor_platform.html">
            
                    
                    统一监控平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="last_tech.html">
            
                <a href="last_tech.html">
            
                    
                    前沿技术
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="distributed_middleware.html">
            
                <a href="distributed_middleware.html">
            
                    
                    分布式中间件研究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="low_latency_comm.html">
            
                <a href="low_latency_comm.html">
            
                    
                    低延迟技术研究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="blockchain.html">
            
                <a href="blockchain.html">
            
                    
                    区块链技术研究
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="challenge-and-chances.html">
            
                <a href="challenge-and-chances.html">
            
                    
                    挑战与机遇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="fen-bu-shi-shu-ju-ku-de-tiao-zhan.html">
            
                <a href="fen-bu-shi-shu-ju-ku-de-tiao-zhan.html">
            
                    
                    分布式数据库的挑战
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >数据交换平台</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;">&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;</h1>
<hr>
<p>&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x4F5C;&#x4E3A;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x4F53;&#x7CFB;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E73;&#x53F0;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x7F51;&#x72B6;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#xFF0C;&#x4E24;&#x70B9;&#x95F4;&#x4E24;&#x4E24;&#x901A;&#x8BAF;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>&#x7531;&#x591A;&#x5E94;&#x7528;&#x8282;&#x70B9;&#x7EC4;&#x6210;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x96C6;&#x7FA4;&#xFF0C;&#x4EFB;&#x610F;&#x5E94;&#x7528;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x540E;&#x90FD;&#x53EF;&#x4EE5;&#x8FC5;&#x901F;&#x5207;&#x6362;&#x5230;&#x5907;&#x4EFD;&#x8282;&#x70B9;&#x3002;&#x670D;&#x52A1;&#x96C6;&#x7FA4;&#x901A;&#x8FC7;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x6216;&#x76F8;&#x5173;&#x8BBE;&#x5907;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x3002;</p>
<p><img src="assets/import_dep_1.png" alt=""></p>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#x56FE;&#xFF0C;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x7531;&#x4EE5;&#x4E0B;&#x51E0;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;</p>
<p><img src="assets/import_dep_02.png" alt=""></p>
<h1 id="&#x8FDB;&#x7A0B;"><strong>&#x8FDB;&#x7A0B;</strong></h1>
<table>
<thead>
<tr>
<th style="text-align:left"></th>
<th style="text-align:left"><strong>&#x63CF;&#x8FF0;</strong></th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x670D;&#x52A1;&#x53D1;&#x5E03;&#x8005;</td>
<td style="text-align:left">&#x53D1;&#x5E03;&#x670D;&#x52A1;&#x6D88;&#x606F;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x901A;&#x8FC7;DEP&#x7EC4;&#x64AD;&#x53D1;&#x5E03;&#x670D;&#x52A1;&#x6D88;&#x606F;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x4E0E;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E13;&#x6709;&#x7684;TCP&#x8FDE;&#x63A5;&#x901A;&#x4FE1;&#x3002;&#x5411;DA&#x6CE8;&#x518C;&#x5176;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x4FE1;&#x606F;&#xFF0C;&#x652F;&#x6301;&#x4E0E;DA&#x4E4B;&#x95F4;TCP&#x76F4;&#x8FDE;&#x901A;&#x4FE1;</td>
</tr>
<tr>
<td style="text-align:left">&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x8005;</td>
<td style="text-align:left">&#x53D1;&#x5E03;&#x670D;&#x52A1;&#x6D88;&#x606F;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x901A;&#x8FC7;DEP&#x7EC4;&#x64AD;&#x53D1;&#x5E03;&#x670D;&#x52A1;&#x6D88;&#x606F;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x4E0E;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E13;&#x6709;&#x7684;TCP&#x8FDE;&#x63A5;&#x901A;&#x4FE1;&#x3002;&#x5411;DA&#x6CE8;&#x518C;&#x5176;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x4FE1;&#x606F;&#xFF0C;&#x652F;&#x6301;&#x4E0E;DA&#x4E4B;&#x95F4;TCP&#x76F4;&#x8FDE;&#x901A;&#x4FE1;</td>
</tr>
<tr>
<td style="text-align:left">DA</td>
<td style="text-align:left">&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x548C;&#x7BA1;&#x7406;&#x529F;&#x80FD;</td>
</tr>
<tr>
<td style="text-align:left">CL</td>
<td style="text-align:left">&#x5B58;&#x50A8;&#x5B50;&#x7F51;&#x4E2D;&#x6240;&#x6709;&#x670D;&#x52A1;&#x53D1;&#x5E03;&#x8005;&#x7684;&#x670D;&#x52A1;&#x6D88;&#x606F;&#xFF0C;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x529F;&#x80FD;&#xFF0C;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x6062;&#x590D;&#x80FD;&#x529B;</td>
</tr>
<tr>
<td style="text-align:left">SMON</td>
<td style="text-align:left">&#x63D0;&#x4F9B;&#x7CFB;&#x7EDF;&#x76D1;&#x63A7;&#x548C;&#x547D;&#x4EE4;&#x63A7;&#x5236;&#x529F;&#x80FD;&#xFF0C;&#x5C06;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x4F20;&#x8F93;&#x5230;&#x4E2D;&#x592E;&#x76D1;&#x63A7;&#x5E73;&#x53F0;</td>
</tr>
<tr>
<td style="text-align:left">MA</td>
<td style="text-align:left">&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x8282;&#x70B9;&#xFF0C;&#x5B9E;&#x73B0;&#x8DE8;&#x7F51;&#x6BB5;&#x901A;&#x4FE1;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x5B50;&#x7F51;&#x91CC;&#x670D;&#x52A1;&#x53D1;&#x5E03;&#x8005;&#x53D1;&#x51FA;&#x7684;&#x7EC4;&#x64AD;&#x6D88;&#x606F;&#xFF0C;&#x4E0E;&#x5176;&#x4ED6;&#x5B50;&#x7F51;&#x7684;MA&#x91C7;&#x7528;TCP&#x76F4;&#x8FDE;&#x901A;&#x4FE1;&#x3002;&#x53EF;&#x4EE5;&#x5411;&#x672C;&#x5B50;&#x7F51;&#x7EC4;&#x64AD;&#x63A5;&#x53D7;&#x6765;&#x81F3;&#x4E8E;&#x5176;&#x4ED6;&#x5B50;&#x7F51;MA&#x7684;&#x6D88;&#x606F;</td>
</tr>
<tr>
<td style="text-align:left">TOE</td>
<td style="text-align:left">&#x5BF9;&#x4E00;&#x7EC4;&#x72EC;&#x7ACB;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x6392;&#x5E8F;&#x3002;&#x6392;&#x5E8F;&#x540E;&#xFF0C;&#x6D88;&#x606F;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x5355;&#x4E00;&#x62A5;&#x6587;&#x901A;&#x9053;&#xFF0C;&#x5E76;&#x4EE5;&#x540C;&#x4E00;&#x6392;&#x5E8F;&#x53D1;&#x9001;&#x5230;&#x6240;&#x6709;&#x63A5;&#x6536;&#x7AEF;</td>
</tr>
<tr>
<td style="text-align:left">CM</td>
<td style="text-align:left">&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x754C;&#x9762;&#xFF0C;&#x901A;&#x8FC7;webservice&#x4ECE;&#x5143;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x5E73;&#x53F0;&#x5BFC;&#x5165;&#x670D;&#x52A1;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x5C06;&#x670D;&#x52A1;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x4ECE;CM&#x914D;&#x7F6E;&#x7ED9;&#x5404;&#x5E94;&#x7528;</td>
</tr>
</tbody>
</table>
<p>&#x4E0B;&#x9762;&#x8BA8;&#x8BBA;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x7684;&#x6280;&#x672F;&#x7279;&#x70B9;&#xFF1A;</p>
<p>1&#xFF09;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x64AD;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;</p>
<pre><code>&#x4E3A;&#x6E1B;&#x5C11;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x548C;&#x5EF6;&#x8FDF;, &#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x7684;&#x5E94;&#x7528;&#x8282;&#x70B9;&#x4EE5;UPD&#x7EC4;&#x64AD;&#x65B9;&#x5F0F;&#x5411;&#x591A;&#x4E2A;&#x63A5;&#x6536;&#x5668;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x867D;&#x7136;UDP&#x7EC4;&#x64AD;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#x5E76;&#x975E;&#x53EF;&#x9760;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x5728;UDP&#x7EC4;&#x64AD;&#x4E0A;&#x5EFA;&#x7ACB;&#x4E86;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x64AD;&#x4F20;&#x8F93;&#x7CFB;&#x7EDF;&#x3002;
</code></pre><p>2&#xFF09;&#x652F;&#x6301;&#x591A;&#x79CD;&#x901A;&#x8BAF;&#x6A21;&#x578B;</p>
<pre><code>&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x652F;&#x6301;&#x53D1;&#x5E03;/&#x8BA2;&#x9605;&#x6A21;&#x578B;&#x5B9E;&#x884C;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x53D1;&#x5E03;&#x8005;&#x6216;&#x751F;&#x7522;&#x8005;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x79F0;&#x4E3A;&#x7528;&#x6237;&#x6216;&#x6D88;&#x8D39;&#x8005;&#x3002;&#x53D1;&#x5E03;/&#x8BA2;&#x9605;&#x6A21;&#x578B;&#x4EE5;&#x901A;&#x9053;&#x4F5C;&#x4E3A;&#x4F20;&#x8F93;&#x5A92;&#x4F53;&#x3002;&#x901A;&#x9053;&#x4EE5;&#x552F;&#x4E00;&#x547D;&#x540D;&#x5B9A;&#x4E49;&#x3002;&#x5B83;&#x4E3A;&#x53D1;&#x5E03;&#x8005;&#x548C;&#x6D88;&#x606F;&#x7528;&#x6237;&#x95F4;&#x63D0;&#x4F9B;&#x903B;&#x8F91;&#x6027;&#x7684;&#x4F20;&#x8F93;&#x673A;&#x5236;&#x3002;&#x5F53;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x81F3;&#x901A;&#x9053;&#x65F6;&#xFF0C;&#x8BA2;&#x9605;&#x8BE5;&#x901A;&#x9053;&#x7684;&#x6240;&#x6709;&#x5E94;&#x7528;&#x5747;&#x80FD;&#x63A5;&#x6536;&#x8BE5;&#x6D88;&#x606F;&#x3002;

&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x4EA6;&#x652F;&#x6301;&#x70B9;&#x5BFE;&#x70B9;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#x3002;&#x5F53;&#x53D1;&#x9001;&#x70B9;&#x5BF9;&#x70B9;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x53D1;&#x9001;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5730;&#x5740;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5728;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x987B;&#x88AB;&#x5206;&#x914D;&#x6216;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x5B9E;&#x4F8B;&#x540D;&#x79F0;&#x3002;&#x53D1;&#x9001;&#x8005;&#x4F7F;&#x7528;&#x6B64;&#x5B9E;&#x4F8B;&#x540D;&#x79F0;&#x4F5C;&#x4E3A;&#x76EE;&#x7684;&#x5730;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x63A5;&#x6536;&#x7AEF;&#x3002;&#x8FD9;&#x79CD;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x53EF;&#x4EE5;&#x4F4D;&#x4E8E;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#x3002;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x7684;&#x4F4D;&#x7F6E;&#x53EF;&#x88AB;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x3002;

&#x8FD9;&#x4E24;&#x79CD;&#x901A;&#x8BAF;&#x6A21;&#x5F0F;&#x53EF;&#x6F14;&#x5316;&#x51FA;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x901A;&#x8BAF;&#x6A21;&#x578B;&#xFF1A;
</code></pre><p>&#x2022;    &#x4E00;&#x5BF9;&#x4E00;</p>
<pre><code>&#x5728;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x901A;&#x8BAF;&#x6A21;&#x578B;&#x91CC;&#xFF0C;&#x7CFB;&#x7EDF;&#x7EC4;&#x4EF6;&#x5F7C;&#x6B64;&#x4EE5;&#x70B9;&#x5BF9;&#x70B9;&#x4EA4;&#x6362;&#x6D88;&#x606F;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x53D1;&#x9001;&#x70B9;&#x5BF9;&#x70B9;&#x547D;&#x4EE4;&#x6D88;&#x606F;&#x5230;&#x5916;&#x6C47;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x3002;&#x5916;&#x6C47;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x4EE5;&#x70B9;&#x5BF9;&#x70B9;&#x5F62;&#x5F0F;&#x56DE;&#x590D;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x72B6;&#x6001;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x3002; 
</code></pre><p><img src="assets/import_dep_04.png" alt=""></p>
<p>&#x2022;    &#x591A;&#x5BF9;&#x4E00;</p>
<pre><code>&#x5728;&#x591A;&#x5BF9;&#x4E00;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x53D1;&#x9001;&#x70B9;&#x5BF9;&#x70B9;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x76D1;&#x63A7;&#x7EC4;&#x4EF6;&#x6A21;&#x5757;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x53D1;&#x9001;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x7EC4;&#x64AD;&#x72B6;&#x6001;&#x8BF7;&#x6C42;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x3002;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x4EE5;&#x70B9;&#x5BF9;&#x70B9;&#x56DE;&#x590D;&#x4ED6;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x548C;&#x7EDF;&#x8BA1;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x3002;
</code></pre><p>&#x2022;    &#x591A;&#x5BF9;&#x4E00;</p>
<pre><code>&#x5728;&#x591A;&#x5BF9;&#x4E00;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x53D1;&#x9001;&#x70B9;&#x5BF9;&#x70B9;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x76D1;&#x63A7;&#x7EC4;&#x4EF6;&#x6A21;&#x5757;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x53D1;&#x9001;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x7EC4;&#x64AD;&#x72B6;&#x6001;&#x8BF7;&#x6C42;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x3002;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x4EE5;&#x70B9;&#x5BF9;&#x70B9;&#x56DE;&#x590D;&#x4ED6;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x548C;&#x7EDF;&#x8BA1;&#x6D88;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x3002;
</code></pre><p><img src="assets/import_dep_06.png" alt=""></p>
<p>&#x2022;    &#x4E00;&#x5BFE;&#x591A;</p>
<pre><code>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x53D1;&#x5E03;/&#x8BA2;&#x9605;&#x6A21;&#x578B;&#x4F8B;&#x5B50;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x81F3;&#x591A;&#x4E2A;&#x4E0B;&#x6E38;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4EA4;&#x6613;&#x6267;&#x884C;&#x540E;&#xFF0C;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#x6267;&#x884C;&#x62A5;&#x544A;&#x6D88;&#x606F;&#x5230;&#x4E0B;&#x6E38;&#x7CFB;&#x7EDF;&#x548C;&#x901A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x76F8;&#x5173;&#x7684;&#x6267;&#x884C;&#x7EC6;&#x8282;&#x3001;&#x5E76;&#x5C06;&#x4FE1;&#x606F;&#x53D1;&#x9001;&#x5230;&#x7ED3;&#x7B97;&#x7CFB;&#x7EDF;&#x548C;&#x5411;&#x5E02;&#x573A;&#x53D1;&#x5E03;&#x7CFB;&#x7EDF;&#x66F4;&#x65B0;&#x62A5;&#x4EF7;&#x3002;
</code></pre><p><img src="assets/import_dep_07.png" alt=""></p>
<p>&#x2022;    &#x591A;&#x5BF9;&#x591A;</p>
<pre><code>&#x5728;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x4F20;&#x64AD;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x53D1;&#x5E03;&#x8005;&#x5E7F;&#x64AD;&#x6D88;&#x606F;&#x7ED9;&#x591A;&#x4E2A;&#x6D88;&#x606F;&#x7528;&#x6237;&#x3002;&#x5F53;&#x4E2D;&#x7684;&#x5178;&#x578B;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x5E7F;&#x64AD;&#x72B6;&#x6001;&#x548C;&#x7EDF;&#x8BA1;&#x6D88;&#x606F;&#x7ED9;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;&#x5668;&#x63D0;&#x4F9B;&#x5BB9;&#x9519;&#x6216;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x4E0D;&#x540C;&#x7684;&#x76D1;&#x63A7;&#x529F;&#x80FD;&#x3002;
</code></pre><p><img src="assets/import_dep_09.png" alt=""></p>
<p>3&#xFF09;&#x652F;&#x6301;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x548C;&#x6CE8;&#x518C;</p>
<pre><code>&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x7684;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x548C;&#x6CE8;&#x518C;&#x529F;&#x80FD;&#x4F7F;&#x7528;&#x4E86;&#x6807;&#x51C6;&#x7684;SLP&#x5F00;&#x653E;&#x534F;&#x8BAE;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x4E86;&#x5B8C;&#x5584;&#x3002;&#x4E3B;&#x8981;&#x7279;&#x70B9;&#x5982;&#x4E0B;:
</code></pre><p>&#x2022;    &#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x8005;&#xFF0C;&#x670D;&#x52A1;&#x7528;&#x6237;&#x548C;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#x670D;&#x52A1;&#x76F8;&#x4E92;&#x6C9F;&#x901A;</p>
<p>&#x2022;    &#x670D;&#x52A1;&#x67E5;&#x8BE2;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x76EE;&#x5F55;&#x4EE3;&#x7406;</p>
<p>&#x2022;    &#x5F15;&#x5165;&#x5FC3;&#x8DF3;&#x673A;&#x5236;&#xFF0C;&#x53EF;&#x68C0;&#x6D4B;&#x670D;&#x52A1;&#x7684;&#x53EF;&#x7528;&#x6027;</p>
<pre><code> &#x670D;&#x52A1;&#x7528;&#x6237;&#x53EF;&#x5229;&#x7528;&#x4E3B;&#x52A8;&#x6216;&#x88AB;&#x52A8;&#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x73B0;&#x53EF;&#x7528;&#x7684;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x5217;&#x8868;&#x3002;&#xFF08;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x6D41;&#x7A0B;&#xFF09;&#x5728;&#x4E3B;&#x52A8;&#x53D1;&#x73B0;&#x673A;&#x5236;&#xFF0C;&#x670D;&#x52A1;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x901A;&#x9053;&#x5411;&#x6240;&#x6709;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x53D1;&#x9001;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#xFF0C;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x4EE5;&#x4E00;&#x5BF9;&#x4E00;&#x65B9;&#x5F0F;&#x56DE;&#x590D;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;&#x8D44;&#x6599;&#x3002;&#x5728;&#x88AB;&#x52A8;&#x53D1;&#x73B0;&#x673A;&#x5236;&#xFF0C;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x5B9A;&#x671F;&#x53D1;&#x5E03;&#x81EA;&#x5DF1;&#x7684;&#x4FE1;&#x606F;&#x5230;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x5E7F;&#x544A;&#x901A;&#x9053;&#xFF0C;&#x670D;&#x52A1;&#x7528;&#x6237;&#x4ECE;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x83B7;&#x5F97;&#x76EE;&#x5F55;&#x4EE3;&#x7406;&#x7684;&#x5217;&#x8868;&#x3002;
</code></pre><p><img src="assets/import_dep_11.png" alt=""></p>
<p>4&#xFF09;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x5907;&#x4EFD;&#x7B56;&#x7565;</p>
<p>&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x95F4;&#x7684;&#x5907;&#x4EFD;&#x5206;&#x4E3A;&#x70ED;&#x5907;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3001;&#x70ED;&#x5907;&#x80FD;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x4EE5;&#x53CA;&#x51B7;&#x5907;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x2022;    &#x70ED;&#x5907;&#x4F46;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x670D;&#x52A1;</p>
<p>&#x540C;&#x4E00;&#x7EC4;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x8282;&#x70B9;&#x6CE8;&#x518C;&#x5404;&#x81EA;&#x4FE1;&#x606F;&#xFF0C;&#x6309;&#x7167;&#x6CE8;&#x518C;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x6CE8;&#x518C;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x6392;&#x9664;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5217;&#x8868;&#x3002;&#x5F53;&#x6709;&#x67E5;&#x8BE2;&#x5BF9;&#x5E94;&#x7684;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x6CE8;&#x518C;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x8FD4;&#x56DE;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x8868;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x670D;&#x52A1;&#x3002;&#x5F53;&#x670D;&#x52A1;&#x5217;&#x8868;&#x4E0A;&#x7B2C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x4E0B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x539F;&#x7B2C;&#x4E00;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x91CD;&#x542F;&#x540E;&#x91CD;&#x65B0;&#x6CE8;&#x518C;&#xFF0C;&#x5219;&#x52A0;&#x5165;&#x5230;&#x670D;&#x52A1;&#x5217;&#x8868;&#x672B;&#x7AEF;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x73B0;&#x6709;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="assets/import_dep_12.png" alt=""></p>
<p>&#x2022;    &#x70ED;&#x5907;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x670D;&#x52A1;</p>
<p>&#x540C;&#x4E00;&#x7EC4;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x8282;&#x70B9;&#x6CE8;&#x518C;&#x5404;&#x81EA;&#x4FE1;&#x606F;&#xFF08;&#x542B;&#x6709;&#x5468;&#x671F;&#x6027;&#x66F4;&#x65B0;&#x7684;&#x8D1F;&#x8F7D;&#x548C;&#x5FC3;&#x8DF3;&#x4FE1;&#x606F;&#xFF09;&#x3002;&#x5F53;&#x6709;&#x67E5;&#x8BE2;&#x8BE5;&#x670D;&#x52A1;&#x7684;&#x8BF7;&#x6C42;&#x5230;&#x6765;&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;&#x8D1F;&#x8F7D;&#x6700;&#x8F7B;&#x7684;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;</p>
<p><img src="assets/import_dep_13.png" alt=""></p>
<ul>
<li>&#xB7;&#x51B7;&#x5907;</li>
</ul>
<p>&#x51B7;&#x5907;&#x53EF;&#x7528;&#x901A;&#x8FC7;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x786C;&#x4EF6;&#x6216;&#x8005;&#x914D;&#x7F6E;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x51B7;&#x5907;&#x6A21;&#x5F0F;&#x4E0B;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x903B;&#x8F91;&#x7B80;&#x5316;&#xFF0C;&#x5065;&#x58EE;&#x6027;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x66F4;&#x53EF;&#x9760;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x9700;&#x6C42;&#x8BB8;&#x53EF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5EFA;&#x8BAE;&#x8BBE;&#x8BA1;&#x65F6;&#x4F18;&#x5148;&#x9009;&#x62E9;&#x6B64;&#x79CD;&#x65B9;&#x6848;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter1.html" class="navigation navigation-prev " aria-label="Previous page: 统一接入平台">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="yuan-shu-ju-guan-li-ping-tai.html" class="navigation navigation-next " aria-label="Next page: 元数据管理平台">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数据交换平台","level":"1.3","depth":1,"next":{"title":"元数据管理平台","level":"1.4","depth":1,"path":"yuan-shu-ju-guan-li-ping-tai.md","ref":"yuan-shu-ju-guan-li-ping-tai.md","articles":[]},"previous":{"title":"统一接入平台","level":"1.2","depth":1,"path":"chapter1.md","ref":"chapter1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"shu-ju-chu-li-ping-tai.md","mtime":"2017-06-13T11:33:25.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-06-13T11:40:53.602Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

